Page({

  data: {
    navdata: {
      title: '注册协议',
      navbar: '2'
    },
    navH: getApp().globalData.navHeight - 2,
    content: ['      在此特别提醒您在注册成为等蛋小程序用户之前,请认真阅读《首创京都期货等蛋小程序用户注册协议》(以下简称“协议”),确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。',
      '      您同意并点击确认本协议条款且完成注册程序后,才能成为等蛋小程序的正式注册用户,并享受等蛋小程序的各类服务。您的注册、登录、使用等行为将视为对本协议的接受。若您不同意本协议,或对本协议中的条款存在任何疑问,请您立即停止等蛋小程序用户注册程序,并可以选择不使用等蛋小程序服务。本协议条款是首创京都期货有限公司(以下称“首创京都期货”或“我们”)对用户相关政策的许诺,请您务必仔细阅读。',
      '1.用户信息采集',
      '      当您在本小程序进行用户注册登记,使用其服务,以及参加其活动时,即为同意本小程序收集您的个人信息,并保存记录,收集的个人信息包括但不限于:姓名、性别、生日、城市、身份证号码、电子邮箱地址、手机电话等。您主动提供的信息越多及越准确,我们就能够更好地为您提供有关服务。',
      '2.用户信息的使用',
      '      本小程序收集个人信息的基本目的是为了更好的了解我们的用户,以便向您提供特色服务和个性化服务。个人信息将主要用于以下几个方面:',
      '(1)完成您对特定服务或产品的要求;',
      '(2)在我们提供服务时,用于身份验证、用户服务、安全防范、诈骗监测、存档和备份,确保我们向您提供的产品和服务的安全性;',
      '(3)帮助我们设计新服务,改善我们的现有服务;',
      '(4)使我们更加了解您如何接入和使用我们的服务,从而有针对性地解决您的个性化需求,例如资讯关注偏好、数据关注偏好、位置设定、个性化的帮助服务和指示,或对您和其他用户作出其他方面的回应；',
      '(5)用于对本小程序用户数据的统计(如用户数量、构成、兴趣、表现等),以便我们向用户提供更好的服务和产品,或以合法目的向第三方披露该类统计数据。该类统计数据都是用户群整体的信息,而非个人的信息；',
      '(6)让您参与我们相关产品和服务的调查。',
      '为了让您有更好的用户体验、改善我们的服务,在符合相关法律法规的前提下,我们将通过某一项服务所收集的信息,以汇集信息或者个性化的方式,用于我们的其他服务。例如,在您使用我们的一项服务时所收集的信息,可能在另一项服务中用于向您提供特定内容,或向您展示与您相关的、非普遍推送的信息。如果我们在相关服务中提供了相应选项,您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。',
      '3.用户信息的共享和披露',
      '等蛋小程序收集您的个人信息,将仅用于为您提供相关服务。一般情况下,在未得到您的同意之前,您的任何个人信息不会被提供给无关的第三方。在下列情况下,我们可能会将您的个人信息提供给有关的第三方:',
      '(1)本小程序的某些服务需由一个合作伙伴(如提供相关技术服务的公司、运输公司等)提供或共同提供。为了向您提供此类服务,小程序有必要与该合作伙伴共享您的个人信息。',
      '(2)本小程序可能会与第三方共同进行推广活动。在推广活动中所收集的全部或部分个人信息可能会与该第三方共享。如果您不想让您的信息被共享,可以通过不参加该推广活动来拒绝。',
      '(3)根据法律法规或政府的强制性规定,我们必须向有关司法或政府部门提供您的个人信息。',
      '(4)为了防止他人的合法权益或社会公共利益受到重大危害。',
      '(5)为了防止您的合法权益受到重大危害。',
      '(6)我们发现您的行为违反了本小程序的服务条款或关于特定服务或产品的任何使用指引,或对信息的合法权益构成重大危害',
      '4.用户管理',
      '      您可以在任何时候通过使用小程序的注册用户名和密码,查询、补充或更正您的小程序账号中的个人信息,或要求删除您在小程序账号中的个人信息。您的小程序账号可以被删除,但这样会导致您不能登录小程序及使用其任何服务。若发现任何非法使用用户账号或存在安全漏洞的情况,请立即通知本站并向公安机关报案。因用户未妥善保管其账号名称及密码而导致第三人盗用账号而给用户造成的损失,由用户自行承担。用户在注册及使用时应承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线,且用户对其发布的内容(包括但不限于文字、图片、用户名等)时,不得有以下情形:',
      '(1)违反宪法或法律法规规定的；',
      '(2)危害国家安全,泄露国家秘密,颠覆国家政权,破坏国家统一的;',
      '(3)损害国家荣誉和利益的,损害公共利益的；',
      '(4)煽动民族仇恨、民族歧视,破坏民族团结的；',
      '(5)破坏国家宗教政策,宣扬邪教和封建迷信的;',
      '(6)散布谣言,扰乱社会秩序,破坏社会稳定的；',
      '(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；',
      '(8)侮辱或者诽谤他人,侵害他人合法权益的；',
      '(9)含有法律、行政法规禁止的其他内容或违反相关的其他规定的。',
      '用户以虚假信息骗取账号，或其账号头像、账号名称、简介等注册信息存在违法和不良信息的,我们有权采取通知限期改正、暂停使用、注销登记等措施。账号仅限于用户本人使用，不允许除本人外的任何人使用,否则该用户应承担由此产生的全部责任,并与实际使用人承担连带责任。',
      '5.信息安全',
      '      您的小程序账号信息和小程序档案通过密码来保护,只有您个人才有权获取这些个人信息，建议您不要向任何人泄露您的密码。本小程序也不会主动致电或发电子邮件给您来询问您的密码,如果您遇到此类情况请及时与等蛋小程序客服联系确认。在我们尽最大努力来保护您的个人信息的同时,本小程序无法进行信息传输,也无法对我们所发的在线产品或服务的信息安全作出肯定或保证。您的风险行为将由自身承担风险。一旦我们收到您传输来的信息,我们将尽最大努力保证其在我们系统的安全。',
      '6.用户隐私制度',
      '      我们会在您自愿的前提下，收集您的个人信息并将这些信息进行整合,包括但不限于注册账号时的相关信息等。尊重用户个人隐私是等蛋小程序的一项基本原则。所以,我们不会公开或向任何第三方透露用户的注册资料以及用户因享受服务而提供的任何信息,但以下情形除外:',
      '(1)事先获得用户的明确授权或许可;',
      '(2)遵守有关法律规定,包括在国家有关机关查询时,提供用户的注册信息、用户在本小程序发布的信息内容及其发布时间、互联网地址或者域名等；',
      '(3)在紧急情况下竭力维护用户个人和社会大众的隐私安全；',
      '(4)根据本条款相关规定或者我们认为必要的其他情形,我们可能会与第三方合作向用户提供相关的网络服务,在此情况下,如该第三方同意承担与我们同等的保护用户隐私的责任,则我们可将用户信息提供给该第三方。',
      '7.所有权及知识产权条款',
      '      本小程序由首创京都期货有限公司拥有和运作。本小程序公开或显示的所有内容,包括但不限于文字、图表、照片、图像、动画、音效、插图及软件(简称“内容”)等,均属首创京都期货及其许可人或内容供应商所有。本小程序内的所有组成要素,包括但不限于整体设计及“内容”,均受商业外观、版权、道德规范、商标及其它所有相关知识产权的法律保护。除非依据本条款与条件或与经首创京都期货有限公司在其它协议的声明同意外,本小程序内的任何部分或组成要素或“内容”均不得以任何方式复制或传播。除非有明确协议同意,否则小程序中的“内容”及一切相关权利都为内容相关成员或其许可人的资产。',
      '8.责任限制',
      '      除非另有明确的书面说明,本小程序及其所包含的或以其它方式通过小程序提供给您的全部信息、内容、材料、产品(包括软件)和服务,均是在“按现状”和“按现有”的基础上提供的。除非另有明确的书面说明,我们不对运营及其包含在本站上的信息、内容、材料、产品(包括软件)或服务作任何形式明示或默示的声明或担保(根据中华人民共和国法律另有规定的以外)。如因不可抗力或其它无法控制的原因使小程序服务系统崩溃或无法正常使用，导致服务不可用或丢失有关的信息、记录等,我们会在合理范围内尽力协助处理善后事宜。',
      '9.免责声明', '      用户明确同意使用等蛋小程序服务的风险由用户承担。我们明确表示不提供任何类型的担保,不论是明确的或隐含的。我们将尽力维护用户使用相关服务的合法权益,但不担保相关服务一定能满足用户的要求,也不担保服务的及时性、安全性、真实性、稳定性、正确性。对用户使用该服务中出现的信息(包括但不限于用户发布的信息)删除或储存失败,我们亦不承担任何责任',
      '      我们对直接、间接、偶然、特殊及继起的损害不负责任,这些损害来自:不正当使用相关服务或应用服务,非法使用服务或用户传送的信息有所变动。', '      我们对本项服务涉及的境内外基础运营商的通信网络故障、技术缺陷、覆盖范围限制、不可抗力、计算机病毒、黑客攻击、用户所在位置、用户关机或其他非技术能力范围内的事因等造成的服务中断、出现乱码、错误接收、无法接收、迟延接收不承担责任。',

      '      我们保留判定用户的行为是否符合本服务协议要求的权利,如果用户违背了本协议的规定,我方有权中止或终止相应服务。',
      '      转户规定:如果用户将手机号码转让给他人,请用户提前自行删除账号内资料。否则受让该号码的用户将能够查看您的个人信息。我们不承担由此引发的用户数据丢失等责任。',
      '10.协议更新及用户关注义务',
      '      根据国家法律法规的更新及小程序运营需要,我们有权对本条款不定期地进行修改,修改后的服务条款一旦被发布在本小程序上立即生效,并替代原有的服务条款。用户可随时登录查阅最新服务条款。如用户不同意更新后的服务条款,应立即停止接受本站提供的服务;如用户继续使用小程序提供的服务,即视为同意更新后的用户协议。我们建议您在使用小程序之前阅读本用户协议及本站的公告。如果本用户协议中任何一条被视为废止无效或因任何理由不可执行,该条应视为可分的且并不影响任何其余协议的有效性和可执行性',
      '11.法律管辖和适用',
      '      本用户协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区现行的有效法律。如发生服务条款的某些内容与适用的法律相抵触时,则这些条款将完全按法律规定重新解释,而其它有效条款继续有效。如约方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时,任何一方均可向中华人民共和国地区法院提起诉讼。',
      '12.其他',
      '      我们尊重用户和消费者的合法权益,本用户协议及小程序上发布的各类规则、政策、声明等其他内容,均是为了更好、更便利的为用户提供服务。欢迎用户和社会各界提出意见和建议,我们将虚心接受并适时修改本服务条款及相关政策、规则。若您完成注册且成为的注册用户则意味着完全接受本用户协议,在注册之前请再次确认已知悉并完全理解本用户协议的全部内容。'
    ],
    contentH: '',
    focus: false
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    this.setData({
      navH: getApp().globalData.navHeight
    });
  },
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})